---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctSettings.FittingAngleUsage
source: html/8112e243-c20e-35e6-02aa-f0e061538cd0.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSettings.FittingAngleUsage Property

Determine how to use fitting angle during duct layout or modifying layout.

## Syntax (C#)
```csharp
public FittingAngleUsage FittingAngleUsage { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration